## :x: Apply Result





<pre><code>Error: Error creating Topic: googleapi: Error 409: Resource already exists in the project (resource=secrets-rotator-dead-letter).

  with google_pubsub_topic.secrets_rotator_dead_letter,
  on secrets-rotator.tf line 1, in resource &#34;google_pubsub_topic&#34; &#34;secrets_rotator_dead_letter&#34;:
   1: resource &#34;google_pubsub_topic&#34; &#34;secrets_rotator_dead_letter&#34; {


Error: Error creating service account: googleapi: Error 409: Service account secrets-rotator already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with google_service_account.secrets-rotator,
  on secrets-rotator.tf line 11, in resource &#34;google_service_account&#34; &#34;secrets-rotator&#34;:
  11: resource &#34;google_service_account&#34; &#34;secrets-rotator&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-keys-rotator already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with module.service_account_keys_rotator.google_service_account.service_account_keys_rotator,
  on ../../modules/rotate-service-account/main.tf line 5, in resource &#34;google_service_account&#34; &#34;service_account_keys_rotator&#34;:
   5: resource &#34;google_service_account&#34; &#34;service_account_keys_rotator&#34; {


Error: Error creating service account: googleapi: Error 409: Service account sa-keys-cleaner already exists within project projects/sap-kyma-prow.
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ResourceInfo&#34;,
    &#34;resourceName&#34;: &#34;projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com&#34;
  }
]
, alreadyExists

  with module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner,
  on ../../modules/service-account-keys-cleaner/main.tf line 5, in resource &#34;google_service_account&#34; &#34;service_account_keys_cleaner&#34;:
   5: resource &#34;google_service_account&#34; &#34;service_account_keys_cleaner&#34; {
</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.service_account_keys_cleaner.data.google_project.project: Reading...
module.github_webhook_gateway.google_pubsub_topic.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled]
google_service_account.terraform_executor: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_service_account.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.cors_proxy.google_cloud_run_service.cors_proxy: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/cors-proxy]
data.google_container_cluster.prow_k8s_cluster: Reading...
module.service_account_keys_rotator.data.google_project.project: Reading...
data.google_container_cluster.untrusted_workload_k8s_cluster: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Reading...
module.github_webhook_gateway.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_dns_managed_zone.build_kyma: Refreshing state... [id=projects/sap-kyma-prow/managedZones/build-kyma]
module.artifact_registry["modules-internal"].data.google_client_config.this: Reading...
module.artifact_registry["modules-internal"].data.google_client_config.this: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
data.google_pubsub_topic.secret-manager-notifications-topic: Reading...
module.cors_proxy.data.google_iam_policy.noauth: Reading...
module.cors_proxy.data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
module.slack_message_sender.google_monitoring_alert_policy.slack_message_sender: Refreshing state... [id=projects/sap-kyma-prow/alertPolicies/17360148176148949136]
data.google_container_cluster.prow_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3-a/clusters/prow]
data.google_container_cluster.trusted_workload_k8s_cluster: Reading...
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Reading...
data.google_pubsub_topic.secret-manager-notifications-topic: Read complete after 0s [id=projects/sap-kyma-prow/topics/secret-manager-notifications]
data.google_client_config.gcp: Reading...
data.google_client_config.gcp: Read complete after 0s [id=projects/"sap-kyma-prow"/regions/"europe-west4"/zones/<null>]
module.github_webhook_gateway.data.google_project.project: Reading...
google_service_account.sa_gke_kyma_integration: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/sa-gke-kyma-integration@sap-kyma-prow.iam.gserviceaccount.com]
data.google_container_cluster.untrusted_workload_k8s_cluster: Read complete after 0s [id=projects/sap-kyma-prow/locations/europe-west3/clusters/untrusted-workload-kyma-prow]
module.github_webhook_gateway.google_service_account.github_webhook_gateway: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.data.google_secret_manager_secret.common_slack_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/common-slack-bot-token]
module.cors_proxy.data.google_project.project: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Reading...
module.github_webhook_gateway.data.google_secret_manager_secret.gh_tools_kyma_bot_token: Read complete after 0s [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Reading...
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal]
module.cors_proxy.google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/sap-kyma-prow/locations/europe-west3/services/cors-proxy]
data.google_container_cluster.trusted_workload_k8s_cluster: Read complete after 1s [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
module.github_webhook_gateway.data.google_secret_manager_secret.webhook_token: Read complete after 1s [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret]
module.service_account_keys_rotator.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
google_container_cluster.trusted_workload: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow]
google_project_iam_member.terraform_executor_prow_project_owner: Refreshing state... [id=sap-kyma-prow/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_project_iam_binding.dns_collector_bucket_get: Refreshing state... [id=sap-kyma-prow/projects/sap-kyma-prow/roles/BucketGet]
google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer: Refreshing state... [id=sap-kyma-prow/roles/containeranalysis.occurrences.viewer]
google_project_iam_member.terraform_executor_workloads_project_owner: Refreshing state... [id=sap-kyma-prow-workloads/roles/owner/serviceAccount:terraform-executor@sap-kyma-prow.iam.gserviceaccount.com]
google_service_account_iam_binding.terraform_workload_identity: Refreshing state... [id=projects/sap-kyma-prow/serviceAccounts/terraform-executor@sap-kyma-prow.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
google_project_iam_binding.dns_collector_dns_reader: Refreshing state... [id=sap-kyma-prow/roles/dns.reader]
module.cors_proxy.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.slack_message_sender.data.google_iam_policy.run_invoker: Reading...
module.slack_message_sender.data.google_iam_policy.run_invoker: Read complete after 0s [id=1526577908]
module.slack_message_sender.google_project_iam_member.project_run_invoker: Refreshing state... [id=sap-kyma-prow/roles/run.invoker/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.slack_message_sender.google_secret_manager_secret_iam_member.slack_msg_sender_common_slack_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/common-slack-bot-token/roles/secretmanager.secretAccessor/serviceAccount:slack-message-sender@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.gh_tools_kyma_bot_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/trusted_default_kyma-bot-github-sap-token/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.github_webhook_gateway.google_pubsub_topic_iam_binding.issue_labeled: Refreshing state... [id=projects/sap-kyma-prow/topics/issue-labeled/roles/pubsub.publisher]
module.github_webhook_gateway.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.github_webhook_gateway.google_secret_manager_secret_iam_member.webhook_token_accessor: Refreshing state... [id=projects/sap-kyma-prow/secrets/sap-tools-github-backlog-webhook-secret/roles/secretmanager.secretAccessor/serviceAccount:github-webhook-gateway@sap-kyma-prow.iam.gserviceaccount.com]
module.service_account_keys_cleaner.data.google_project.project: Read complete after 1s [id=projects/sap-kyma-prow]
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.prow_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/prow/**.yaml"]: Read complete after 0s [id=855a9e69c8456439c97de0f50933e09215da23ba88f3d11f61e9195746970b7a]
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.prow_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.member_service_account[0]: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.writer/serviceAccount:kyma-submission-pipeline@kyma-project.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com"]: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-dev.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com"]: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-prod.iam.gserviceaccount.com]
module.artifact_registry["modules-internal"].google_artifact_registry_repository_iam_member.reader_service_accounts["klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com"]: Refreshing state... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal/roles/artifactregistry.reader/serviceAccount:klm-controller-manager@sap-ti-dx-kyma-mps-stage.iam.gserviceaccount.com]
kubernetes_cluster_role.access_signify_secrets_untrusted_workloads: Refreshing state... [id=access-signify-secrets]
kubernetes_service_account.untrusted_workload_terraform_executor: Refreshing state... [id=default/terraform-executor]
kubernetes_cluster_role.access_kyma_bot_github_tokens_untrusted_workloads: Refreshing state... [id=access-kyma-bot-github-tokens]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/untrusted/**.yaml"]: Read complete after 0s [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Reading...
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraints_path["../../../../prow/cluster/resources/gatekeeper-constraints/workloads/**.yaml"]: Read complete after 0s [id=6af909c08872d079a40e592ccbf4c561c32918067a6a6af2ab6df866648c3d4f]
google_container_node_pool.prowjobs_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/prowjobs-pool]
module.untrusted_workload_gatekeeper.data.kubectl_path_documents.constraint_templates_path["../../../../opa/gatekeeper/constraint-templates/**.yaml"]: Read complete after 0s [id=927f68fe2b1bee2bed9ddde896cce2ee56bbf0312119b6937b57278b94152090]
google_container_node_pool.components_pool: Refreshing state... [id=projects/sap-kyma-prow/locations/europe-west4/clusters/trusted-workload-kyma-prow/nodePools/components-pool]
module.untrusted_workload_gatekeeper.data.kubectl_file_documents.gatekeeper: Read complete after 0s [id=dd3443633a39325c8656d232ea51eb8515040007156fb9e6433fddd5276456b6]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/rbac.authorization.k8s.io/v1/clusterroles/gatekeeper-manager-role"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/gatekeeper-manager-role]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/modifyset.mutations.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/modifyset.mutations.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/providers.externaldata.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/providers.externaldata.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/expansiontemplatepodstatuses.status.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/expansiontemplatepodstatuses.status.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/constrainttemplatepodstatuses.status.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/constrainttemplatepodstatuses.status.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/api/v1/namespaces/gatekeeper-system/services/gatekeeper-webhook-service"]: Refreshing state... [id=/api/v1/namespaces/gatekeeper-system/services/gatekeeper-webhook-service]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/mutatorpodstatuses.status.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/mutatorpodstatuses.status.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/policy/v1/namespaces/gatekeeper-system/poddisruptionbudgets/gatekeeper-controller-manager"]: Refreshing state... [id=/apis/policy/v1/namespaces/gatekeeper-system/poddisruptionbudgets/gatekeeper-controller-manager]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/api/v1/namespaces/gatekeeper-system"]: Refreshing state... [id=/api/v1/namespaces/gatekeeper-system]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/api/v1/namespaces/gatekeeper-system/resourcequotas/gatekeeper-critical-pods"]: Refreshing state... [id=/api/v1/namespaces/gatekeeper-system/resourcequotas/gatekeeper-critical-pods]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/constraintpodstatuses.status.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/constraintpodstatuses.status.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit"]: Refreshing state... [id=/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-audit]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/assignimage.mutations.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/assignimage.mutations.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager"]: Refreshing state... [id=/apis/apps/v1/namespaces/gatekeeper-system/deployments/gatekeeper-controller-manager]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/api/v1/namespaces/gatekeeper-system/serviceaccounts/gatekeeper-admin"]: Refreshing state... [id=/api/v1/namespaces/gatekeeper-system/serviceaccounts/gatekeeper-admin]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/assign.mutations.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/assign.mutations.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/api/v1/namespaces/gatekeeper-system/secrets/gatekeeper-webhook-server-cert"]: Refreshing state... [id=/api/v1/namespaces/gatekeeper-system/secrets/gatekeeper-webhook-server-cert]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/assignmetadata.mutations.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/assignmetadata.mutations.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/rbac.authorization.k8s.io/v1/namespaces/gatekeeper-system/rolebindings/gatekeeper-manager-rolebinding"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/gatekeeper-system/rolebindings/gatekeeper-manager-rolebinding]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/admissionregistration.k8s.io/v1/mutatingwebhookconfigurations/gatekeeper-mutating-webhook-configuration"]: Refreshing state... [id=/apis/admissionregistration.k8s.io/v1/mutatingwebhookconfigurations/gatekeeper-mutating-webhook-configuration]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/gatekeeper-manager-rolebinding"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/gatekeeper-manager-rolebinding]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/expansiontemplate.expansion.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/expansiontemplate.expansion.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/constrainttemplates.templates.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/constrainttemplates.templates.gatekeeper.sh]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/rbac.authorization.k8s.io/v1/namespaces/gatekeeper-system/roles/gatekeeper-manager-role"]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/gatekeeper-system/roles/gatekeeper-manager-role]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/admissionregistration.k8s.io/v1/validatingwebhookconfigurations/gatekeeper-validating-webhook-configuration"]: Refreshing state... [id=/apis/admissionregistration.k8s.io/v1/validatingwebhookconfigurations/gatekeeper-validating-webhook-configuration]
module.prow_gatekeeper.kubectl_manifest.gatekeeper["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/configs.config.gatekeeper.sh"]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/configs.config.gatekeeper.sh]
module.slack_message_sender.google_cloud_run_service.slack_message_sender: Refreshing state... [id=locations/europe-west3/namespaces/sap-kyma-prow/services/slack-message-sender]
module.prow_gatekeeper.kubectl_manifest.constraint_templates["apiVersion: templates.gatekeeper.sh/v1\nkind: ConstraintTemplate\nmetadata:\n  name: k8spspcapabilities\n  annotations:\n    metadata.gatekeeper.sh/title: \"Capabilities\"\n    metadata.gatekeeper.sh/version: 1.0.0\n    description: >-\n      Controls Linux capabilities on containers. Corresponds to the\n      `allowedCapabilities` and `requiredDropCapabilities` fields in a\n      PodSecurityPolicy. For more information, see\n      https://kubernetes.io/docs/concepts/policy/pod-security-policy/#capabilities\nspec:\n  crd:\n    spec:\n      names:\n        kind: K8sPSPCapabilities\n      validation:\n        # Schema for the `parameters` field\n        openAPIV3Schema:\n          type: object\n          description: >-\n            Controls Linux capabilities on containers. Corresponds to the\n            `allowedCapa

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ject_service_identity.pubsub_identity_agent will be created
  + resource "google_project_service_identity" "pubsub_identity_agent" {
      + email   = (known after apply)
      + id      = (known after apply)
      + project = (known after apply)
      + service = "pubsub.googleapis.com"
    }

  # module.service_account_keys_rotator.google_pubsub_subscription.service_account_keys_rotator will be created
  + resource "google_pubsub_subscription" "service_account_keys_rotator" {
      + ack_deadline_seconds       = 20
      + filter                     = "attributes.eventType = \"SECRET_ROTATE\""
      + id                         = (known after apply)
      + labels                     = {
          + "application_name" = "secrets-rotator"
        }
      + message_retention_duration = "604800s"
      + name                       = "secrets-rotator-service-account-keys-rotator"
      + project                    = (known after apply)
      + topic                      = "secret-manager-notifications"

      + dead_letter_policy {
          + dead_letter_topic     = (known after apply)
          + max_delivery_attempts = 15
        }

      + expiration_policy {
          + ttl = "31556952s"
        }

      + push_config {
          + push_endpoint = (known after apply)

          + oidc_token {
              + service_account_email = (known after apply)
            }
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.service_account_keys_rotator.google_service_account.service_account_keys_rotator will be created
  + resource "google_service_account" "service_account_keys_rotator" {
      + account_id  = "sa-keys-rotator"
      + description = "Identity of the service account keys rotator service."
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

Plan: 21 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ artifact_registry                  = {
      ~ modules-internal = {
          ~ artifact_registry_collection = {
                id                        = "projects/sap-kyma-prow/locations/europe/repositories/modules-internal"
                name                      = "modules-internal"
              ~ update_time               = "2023-08-18T22:49:29.593538Z" -> "2023-08-21T00:46:29.441582Z"
                # (14 unchanged elements hidden)
            }
        }
    }
  + secret-manager-notifications-topic = {
      + id                         = "projects/sap-kyma-prow/topics/secret-manager-notifications"
      + kms_key_name               = ""
      + labels                     = {}
      + message_retention_duration = ""
      + message_storage_policy     = [
          + {
              + allowed_persistence_regions = [
                  + "asia-east1",
                  + "asia-east2",
                  + "asia-northeast1",
                  + "asia-northeast2",
                  + "asia-northeast3",
                  + "asia-south1",
                  + "asia-south2",
                  + "asia-southeast1",
                  + "asia-southeast2",
                  + "australia-southeast1",
                  + "australia-southeast2",
                  + "europe-central2",
                  + "europe-north1",
                  + "europe-west1",
                  + "europe-west2",
                  + "europe-west3",
                  + "europe-west4",
                  + "europe-west6",
                  + "northamerica-northeast1",
                  + "northamerica-northeast2",
                  + "southamerica-east1",
                  + "us-central1",
                  + "us-central2",
                  + "us-east1",
                  + "us-east4",
                  + "us-west1",
                  + "us-west2",
                  + "us-west3",
                  + "us-west4",
                ]
            },
        ]
      + name                       = "secret-manager-notifications"
      + project                    = "sap-kyma-prow"
      + schema_settings            = []
    }
  + secrets-rotator                    = {
      + account_id   = "secrets-rotator"
      + description  = null
      + disabled     = false
      + display_name = "Identity of the secrets rotator application"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + timeouts     = null
      + unique_id    = (known after apply)
    }
  + secrets_rotator_dead_letter_topic  = {
      + id                         = (known after apply)
      + kms_key_name               = null
      + labels                     = {
          + "application" = "secrets-rotator"
        }
      + message_retention_duration = "86600s"
      + message_storage_policy     = (known after apply)
      + name                       = "secrets-rotator-dead-letter"
      + project                    = (known after apply)
      + schema_settings            = (known after apply)
      + timeouts                   = null
    }
  + service_account_keys_cleaner       = {
      + service_account_keys_cleaner_cloud_run_service = {
          + autogenerate_revision_name = false
          + id                         = (known after apply)
          + location                   = "europe-west4"
          + metadata                   = (known after apply)
          + name                       = "service-account-keys-cleaner"
          + project                    = (known after apply)
          + status                     = (known after apply)
          + template                   = [
              + {
                  + metadata = (known after apply)
                  + spec     = [
                      + {
                          + container_concurrency = (known after apply)
                          + containers            = [
                              + {
                                  + args           = null
                                  + command        = null
                                  + env            = [
                                      + {
                                          + name       = "APPLICATION_NAME"
                                          + value      = "secrets-rotator"
                                          + value_from = []
                                        },
                                      + {
                                          + name       = "COMPONENT_NAME"
                                          + value      = "service-account-keys-cleaner"
                                          + value_from = []
                                        },
                                      + {
                                          + name       = "LISTEN_PORT"
                                          + value      = "8080"
                                          + value_from = []
                                        },
                                    ]
                                  + env_from       = []
                                  + image          = "europe-docker.pkg.dev/kyma-project/prod/test-infra/service-account-keys-cleaner:v20230301-6267d66d"
                                  + liveness_probe = []
                                  + name           = (known after apply)
                                  + ports          = (known after apply)
                                  + resources      = (known after apply)
                                  + startup_probe  = (known after apply)
                                  + volume_mounts  = []
                                  + working_dir    = null
                                },
                            ]
                          + service_account_name  = (known after apply)
                          + serving_state         = (known after apply)
                          + timeout_seconds       = (known after apply)
                          + volumes               = []
                        },
                    ]
                },
            ]
          + timeouts                   = null
          + traffic                    = (known after apply)
        }
      + service_account_keys_cleaner_secheduler        = {
          + app_engine_http_target = []
          + attempt_deadline       = "320s"
          + description            = "Call service account keys cleaner service, to remove old versions of secrets"
          + http_target            = [
              + {
                  + body        = null
                  + headers     = null
                  + http_method = "GET"
                  + oauth_token = []
                  + oidc_token  = [
                      + {
                          + audience              = (known after apply)
                          + service_account_email = (known after apply)
                        },
                    ]
                  + uri         = (known after apply)
                },
            ]
          + id                     = (known after apply)
          + name                   = "service-account-keys-cleaner"
          + paused                 = (known after apply)
          + project                = (known after apply)
          + pubsub_target          = []
          + region                 = "europe-west4"
          + retry_config           = []
          + schedule               = "0 0 * * 1-5"
          + state                  = (known after apply)
          + time_zone              = "Etc/UTC"
          + timeouts               = null
        }
      + service_account_keys_cleaner_service_account   = {
          + account_id   = "sa-keys-cleaner"
          + description  = "Identity of the service account keys rotator service."
          + disabled     = false
          + display_name = null
          + email        = (known after apply)
          + id           = (known after apply)
          + member       = (known after apply)
          + name         = (known after apply)
          + project      = (known after apply)
          + timeouts     = null
          + unique_id    = (known after apply)
        }
    }
  + service_account_keys_rotator       = {
      + service_account_keys_rotator_cloud_run_service   = {
          + autogenerate_revision_name = false
          + id                         = (known after apply)
          + location                   = "europe-west4"
          + metadata                   = (known after apply)
          + name                       = "service-account-keys-rotator"
          + project                    = (known after apply)
          + status                     = (known after apply)
          + template                   = [
              + {
                  + metadata = (known after apply)
                  + spec     = [
                      + {
                          + container_concurrency = (known after apply)
                          + containers            = [
                              + {
                                  + args           = null
                                  + command        = null
                                  + env            = [
                                      + {
                                          + name       = "APPLICATION_NAME"
                                          + value      = "secrets-rotator"
                                          + value_from = []
                                        },
                                      + {
                                          + name       = "COMPONENT_NAME"
                                          + value      = "service-account-keys-rotator"
                                          + value_from = []
                                        },
                                      + {
                                          + name       = "LISTEN_PORT"
                                          + value      = "8080"
                                          + value_from = []
                                        },
                                    ]
                                  + env_from       = []
                                  + image          = "europe-docker.pkg.dev/kyma-project/prod/test-infra/rotate-service-account:v20230307-cf164cd1"
                                  + liveness_probe = []
                                  + name           = (known after apply)
                                  + ports          = (known after apply)
                                  + resources      = (known after apply)
                                  + startup_probe  = (known after apply)
                                  + volume_mounts  = []
                                  + working_dir    = null
                                },
                            ]
                          + service_account_name  = (known after apply)
                          + serving_state         = (known after apply)
                          + timeout_seconds       = (known after apply)
                          + volumes               = []
                        },
                    ]
                },
            ]
          + timeouts                   = null
          + traffic                    = (known after apply)
        }
      + service_account_keys_rotator_service_account     = {
          + account_id   = "sa-keys-rotator"
          + description  = "Identity of the service account keys rotator service."
          + disabled     = false
          + display_name = null
          + email        = (known after apply)
          + id           = (known after apply)
          + member       = (known after apply)
          + name         = (known after apply)
          + project      = (known after apply)
          + timeouts     = null
          + unique_id    = (known after apply)
        }
      + service_account_keys_rotator_service_account_iam = {
          + condition = []
          + etag      = (known after apply)
          + id        = (known after apply)
          + member    = (known after apply)
          + project   = "sap-kyma-prow"
          + role      = "roles/iam.serviceAccountKeyAdmin"
        }
      + service_account_keys_rotator_subscription        = {
          + ack_deadline_seconds         = 20
          + bigquery_config              = []
          + cloud_storage_config         = []
          + dead_letter_policy           = [
              + {
                  + dead_letter_topic     = (known after apply)
                  + max_delivery_attempts = 15
                },
            ]
          + enable_exactly_once_delivery = null
          + enable_message_ordering      = null
          + expiration_policy            = [
              + {
                  + ttl = "31556952s"
                },
            ]
          + filter                       = "attributes.eventType = \"SECRET_ROTATE\""
          + id                           = (known after apply)
          + labels                       = {
              + "application_name" = "secrets-rotator"
            }
          + message_retention_duration   = "604800s"
          + name                         = "secrets-rotator-service-account-keys-rotator"
          + project                      = (known after apply)
          + push_config                  = [
              + {
                  + attributes    = null
                  + no_wrapper    = []
                  + oidc_token    = [
                      + {
                          + audience              = null
                          + service_account_email = (known after apply)
                        },
                    ]
                  + push_endpoint = (known after apply)
                },
            ]
          + retain_acked_messages        = null
          + retry_policy                 = [
              + {
                  + maximum_backoff = "600s"
                  + minimum_backoff = "300s"
                },
            ]
          + timeouts                     = null
          + topic                        = "secret-manager-notifications"
        }
    }
module.service_account_keys_rotator.google_service_account.service_account_keys_rotator: Creating...
google_service_account.secrets-rotator: Creating...
module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner: Creating...
google_pubsub_topic.secrets_rotator_dead_letter: Creating...
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Modifying... [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal]
module.artifact_registry["modules-internal"].google_artifact_registry_repository.artifact_registry: Modifications complete after 0s [id=projects/sap-kyma-prow/locations/europe/repositories/modules-internal]
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Creating...
module.service_account_keys_rotator.google_project_service_identity.pubsub_identity_agent: Creation complete after 1s [id=projects/sap-kyma-prow/services/pubsub.googleapis.com]
module.service_account_keys_rotator.google_project_iam_binding.pubsub_project_token_creator: Creating...
module.service_account_keys_rotator.google_project_iam_binding.pubsub_project_token_creator: Creation complete after 9s [id=sap-kyma-prow/roles/iam.serviceAccountTokenCreator]

Error: Error creating Topic: googleapi: Error 409: Resource already exists in the project (resource=secrets-rotator-dead-letter).

  with google_pubsub_topic.secrets_rotator_dead_letter,
  on secrets-rotator.tf line 1, in resource "google_pubsub_topic" "secrets_rotator_dead_letter":
   1: resource "google_pubsub_topic" "secrets_rotator_dead_letter" {


Error: Error creating service account: googleapi: Error 409: Service account secrets-rotator already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/secrets-rotator@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with google_service_account.secrets-rotator,
  on secrets-rotator.tf line 11, in resource "google_service_account" "secrets-rotator":
  11: resource "google_service_account" "secrets-rotator" {


Error: Error creating service account: googleapi: Error 409: Service account sa-keys-rotator already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-keys-rotator@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with module.service_account_keys_rotator.google_service_account.service_account_keys_rotator,
  on ../../modules/rotate-service-account/main.tf line 5, in resource "google_service_account" "service_account_keys_rotator":
   5: resource "google_service_account" "service_account_keys_rotator" {


Error: Error creating service account: googleapi: Error 409: Service account sa-keys-cleaner already exists within project projects/sap-kyma-prow.
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.ResourceInfo",
    "resourceName": "projects/sap-kyma-prow/serviceAccounts/sa-keys-cleaner@sap-kyma-prow.iam.gserviceaccount.com"
  }
]
, alreadyExists

  with module.service_account_keys_cleaner.google_service_account.service_account_keys_cleaner,
  on ../../modules/service-account-keys-cleaner/main.tf line 5, in resource "google_service_account" "service_account_keys_cleaner":
   5: resource "google_service_account" "service_account_keys_cleaner" {


```

</details>

`

<!-- github-comment: {"Command":"apply","PRNumber":8706,"Program":"tfcmt","SHA1":"5000702156760e1ae383894942e19cc29f93181c","Vars":{}} -->